# Homebrew stuff
tap "homebrew/core"
tap "homebrew/cask"
tap "homebrew/cask-versions"
tap "homebrew/services"
tap "homebrew/bundle"

# add taps
tap "anchore/grype"
tap "anchore/syft"
tap "bufbuild/buf"
tap "buo/cask-upgrade"
tap "fairwindsops/tap"
tap "fluxcd/tap"
tap "gabrie30/utils"
tap "komiserio/komiser"
tap "norwoodj/tap"
tap "snyk/tap"
tap "weaveworks/tap"

# ZSH stuff
brew "zsh-autosuggestions"
brew "zsh-completions"
brew "zsh-syntax-highlighting"
brew "romkatv/powerlevel10k/powerlevel10k"

# git
brew "git"
brew "git-delta"
brew "git-lfs"
brew "gh"                   # github cli
brew "gabrie30/utils/ghorg" # backup github orgs

# add mac app store cli
brew "mas"

# langauge and tools
brew "ballerina"
brew "python@3.9"
brew "go"
brew "node"
brew "nvm"
brew "python@3.9"
brew "yarn"

# frameworks
brew "hugo"

# cli stuff
brew "dog"
brew "fzf"
brew "asdf"
brew "bash"
brew "bat"  # colorized cat
# brew "htop"
brew "btop" # better top/htop
brew "exa"  # better ls
brew "httpie"
brew "jid"
brew "jo"
brew "jq"
brew "make"
brew "tree"
brew "tealdeer"   # fast tldr, summary of commands
brew "pre-commit"
brew "just"       # better makefile
brew "rsync"
brew "sl"         # sl train
brew "step"
brew "thefuck"
brew "vault"
brew "watch"
brew "wget"
brew "yamllint"
brew "yq"
brew "zlib"

# keys
brew "age"
brew "sops"

# cloud stuff
brew "awscli"
cask "google-cloud-sdk"
brew "infracost"
brew "terraform"
brew "terragrunt"
brew "tfsec"

# helm
brew "helm"
brew "norwoodj/tap/helm-docs"
brew "chart-testing"

# container stuff
brew "docker"
brew "docker-compose"
brew "colima"              # docker desktop alternative
brew "anchore/grype/grype" # vulnerability scanner for container images and filesystems
brew "anchore/syft/syft"   # generating a Software Bill of Materials from container images and filesystems

# kubernetes
brew "kubectx"   # context
brew "kubescape" # security scanner
brew "kustomize"
brew "kyverno"   # policy management
brew "linkerd"   # service mesh
brew "fairwindsops/tap/pluto"
brew "stern"                  # log forwarding

# GitOps
brew "fluxcd/tap/flux"
brew "weaveworks/tap/gitops"

# gRPC / ProtoBuf
brew "protobuf"
brew "bufbuild/buf/buf"

# Casks
cask "aldente"      # macOS tool to limit maximum charging percentage
cask "beardedspice" # allows you to control web based media players
cask "clipy"        # clipboard manager
cask "dozer"        # Hide menu bar icons on macOS
cask "meetingbar"   # Your next meeting in the macOS menu bar
cask "rectangle"    # Move and resize windows in macOS using keyboard shortcuts
cask "slack"
cask "spotify"
cask "visual-studio-code"
cask "vlc"

mas "Amphetamine", id: 937984704  # keep-awake app
mas "Bitwarden", id: 1352778147
# mas "Rocket.Chat", id: 1086818840
# mas "Xcode", id: 497799835
